
## :x: Apply Failed

[CI link](https://github.com/kazuki-iwanaga/iwanaga-sandbox/actions/runs/7725814649)



<pre><code>Error: Error, failed to create instance db: googleapi: Error 400: Invalid request: At least one of Public IP or Private IP or PSC connectivity must be enabled.., invalid

  with google_sql_database_instance.db,
  on db.tf line 3, in resource &#34;google_sql_database_instance&#34; &#34;db&#34;:
   3: resource &#34;google_sql_database_instance&#34; &#34;db&#34; {

Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions]%0Agoogle_service_account.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions[&#34;roles/storage.admin&#34;]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.admin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions[&#34;roles/storage.objectAdmin&#34;]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.objectAdmin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions[&#34;roles/editor&#34;]: Refreshing state... [id=iwanaga-sandbox-dev/roles/editor/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_service_account_iam_member.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1021157674555/locations/global/workloadIdentityPools/gh-actions/attribute.repository/kazuki-iwanaga/iwanaga-sandbox]%0Agoogle_iam_workload_identity_pool_provider.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions/providers/gh-actions]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A%0ATerraform will perform the following actions:%0A%0A  # google_sql_database_instance.db will be created%0A  &#43; resource &#34;google_sql_database_instance&#34; &#34;db&#34; {%0A      &#43; available_maintenance_versions = (known after apply)%0A      &#43; connection_name                = (known after apply)%0A      &#43; database_version               = &#34;POSTGRES_15&#34;%0A      &#43; deletion_protection            = true%0A      &#43; dns_name                       = (known after apply)%0A      &#43; encryption_key_name            = (known after apply)%0A      &#43; first_ip_address               = (known after apply)%0A      &#43; id                             = (known after apply)%0A      &#43; instance_type                  = (known after apply)%0A      &#43; ip_address                     = (known after apply)%0A      &#43; maintenance_version            = (known after apply)%0A      &#43; master_instance_name           = (known after apply)%0A      &#43; name                           = &#34;db&#34;%0A      &#43; private_ip_address             = (known after apply)%0A      &#43; project                        = &#34;iwanaga-sandbox-dev&#34;%0A      &#43; psc_service_attachment_link    = (known after apply)%0A      &#43; public_ip_address              = (known after apply)%0A      &#43; region                         = (known after apply)%0A      &#43; self_link                      = (known after apply)%0A      &#43; server_ca_cert                 = (sensitive value)%0A      &#43; service_account_email_address  = (known after apply)%0A%0A      &#43; settings {%0A          &#43; activation_policy     = &#34;ALWAYS&#34;%0A          &#43; availability_type     = &#34;ZONAL&#34;%0A          &#43; connector_enforcement = (known after apply)%0A          &#43; disk_autoresize       = true%0A          &#43; disk_autoresize_limit = 0%0A          &#43; disk_size             = (known after apply)%0A          &#43; disk_type             = &#34;PD_SSD&#34;%0A          &#43; edition               = &#34;ENTERPRISE&#34;%0A          &#43; pricing_plan          = &#34;PER_USE&#34;%0A          &#43; tier                  = &#34;db-f1-micro&#34;%0A          &#43; user_labels           = (known after apply)%0A          &#43; version               = (known after apply)%0A%0A          &#43; database_flags {%0A              &#43; name  = &#34;log_checkpoints&#34;%0A              &#43; value = &#34;on&#34;%0A            }%0A          &#43; database_flags {%0A              &#43; name  = &#34;log_connections&#34;%0A              &#43; value = &#34;on&#34;%0A            }%0A          &#43; database_flags {%0A              &#43; name  = &#34;log_disconnections&#34;%0A              &#43; value = &#34;on&#34;%0A            }%0A          &#43; database_flags {%0A              &#43; name  = &#34;log_lock_waits&#34;%0A              &#43; value = &#34;on&#34;%0A            }%0A          &#43; database_flags {%0A              &#43; name  = &#34;log_temp_files&#34;%0A              &#43; value = &#34;0&#34;%0A            }%0A%0A          &#43; ip_configuration {%0A              &#43; enable_private_path_for_google_cloud_services = true%0A              &#43; ipv4_enabled                                  = false%0A              &#43; require_ssl                                   = true%0A              &#43; ssl_mode                                      = (known after apply)%0A%0A              &#43; authorized_networks {%0A                  &#43; name  = &#34;internal&#34;%0A                  &#43; value = &#34;10.0.0.1/24&#34;%0A                }%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_sql_database_instance.db: Creating...%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: %0AError: Error, failed to create instance db: googleapi: Error 400: Invalid request: At least one of Public IP or Private IP or PSC connectivity must be enabled.., invalid%0A%0A  with google_sql_database_instance.db,%0A  on db.tf line 3, in resource &#34;google_sql_database_instance&#34; &#34;db&#34;:%0A   3: resource &#34;google_sql_database_instance&#34; &#34;db&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/678aeee1-b312-4dd6-b7ca-cc2e9d134714/terraform-bin apply -auto-approve -no-color -var gcp_project_id=iwanaga-sandbox-dev
google_iam_workload_identity_pool.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions]
google_service_account.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/storage.admin"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.admin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/storage.objectAdmin"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.objectAdmin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]
google_project_iam_member.github_actions["roles/editor"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/editor/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]
google_service_account_iam_member.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1021157674555/locations/global/workloadIdentityPools/gh-actions/attribute.repository/kazuki-iwanaga/iwanaga-sandbox]
google_iam_workload_identity_pool_provider.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions/providers/gh-actions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database_instance.db will be created
  + resource "google_sql_database_instance" "db" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "db"
      + private_ip_address             = (known after apply)
      + project                        = "iwanaga-sandbox-dev"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_lock_waits"
              + value = "on"
            }
          + database_flags {
              + name  = "log_temp_files"
              + value = "0"
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + require_ssl                                   = true
              + ssl_mode                                      = (known after apply)

              + authorized_networks {
                  + name  = "internal"
                  + value = "10.0.0.1/24"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_sql_database_instance.db: Creating...

Error: Error, failed to create instance db: googleapi: Error 400: Invalid request: At least one of Public IP or Private IP or PSC connectivity must be enabled.., invalid

  with google_sql_database_instance.db,
  on db.tf line 3, in resource "google_sql_database_instance" "db":
   3: resource "google_sql_database_instance" "db" {

Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 1.
::debug::stdout: google_iam_workload_identity_pool.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions]%0Agoogle_service_account.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions["roles/storage.admin"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.admin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions["roles/storage.objectAdmin"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/storage.objectAdmin/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_project_iam_member.github_actions["roles/editor"]: Refreshing state... [id=iwanaga-sandbox-dev/roles/editor/serviceAccount:gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com]%0Agoogle_service_account_iam_member.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/serviceAccounts/gh-actions@iwanaga-sandbox-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1021157674555/locations/global/workloadIdentityPools/gh-actions/attribute.repository/kazuki-iwanaga/iwanaga-sandbox]%0Agoogle_iam_workload_identity_pool_provider.gh_actions: Refreshing state... [id=projects/iwanaga-sandbox-dev/locations/global/workloadIdentityPools/gh-actions/providers/gh-actions]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_sql_database_instance.db will be created%0A  + resource "google_sql_database_instance" "db" {%0A      + available_maintenance_versions = (known after apply)%0A      + connection_name                = (known after apply)%0A      + database_version               = "POSTGRES_15"%0A      + deletion_protection            = true%0A      + dns_name                       = (known after apply)%0A      + encryption_key_name            = (known after apply)%0A      + first_ip_address               = (known after apply)%0A      + id                             = (known after apply)%0A      + instance_type                  = (known after apply)%0A      + ip_address                     = (known after apply)%0A      + maintenance_version            = (known after apply)%0A      + master_instance_name           = (known after apply)%0A      + name                           = "db"%0A      + private_ip_address             = (known after apply)%0A      + project                        = "iwanaga-sandbox-dev"%0A      + psc_service_attachment_link    = (known after apply)%0A      + public_ip_address              = (known after apply)%0A      + region                         = (known after apply)%0A      + self_link                      = (known after apply)%0A      + server_ca_cert                 = (sensitive value)%0A      + service_account_email_address  = (known after apply)%0A%0A      + settings {%0A          + activation_policy     = "ALWAYS"%0A          + availability_type     = "ZONAL"%0A          + connector_enforcement = (known after apply)%0A          + disk_autoresize       = true%0A          + disk_autoresize_limit = 0%0A          + disk_size             = (known after apply)%0A          + disk_type             = "PD_SSD"%0A          + edition               = "ENTERPRISE"%0A          + pricing_plan          = "PER_USE"%0A          + tier                  = "db-f1-micro"%0A          + user_labels           = (known after apply)%0A          + version               = (known after apply)%0A%0A          + database_flags {%0A              + name  = "log_checkpoints"%0A              + value = "on"%0A            }%0A          + database_flags {%0A              + name  = "log_connections"%0A              + value = "on"%0A            }%0A          + database_flags {%0A              + name  = "log_disconnections"%0A              + value = "on"%0A            }%0A          + database_flags {%0A              + name  = "log_lock_waits"%0A              + value = "on"%0A            }%0A          + database_flags {%0A              + name  = "log_temp_files"%0A              + value = "0"%0A            }%0A%0A          + ip_configuration {%0A              + enable_private_path_for_google_cloud_services = true%0A              + ipv4_enabled                                  = false%0A              + require_ssl                                   = true%0A              + ssl_mode                                      = (known after apply)%0A%0A              + authorized_networks {%0A                  + name  = "internal"%0A                  + value = "10.0.0.1/24"%0A                }%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_sql_database_instance.db: Creating...%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: %0AError: Error, failed to create instance db: googleapi: Error 400: Invalid request: At least one of Public IP or Private IP or PSC connectivity must be enabled.., invalid%0A%0A  with google_sql_database_instance.db,%0A  on db.tf line 3, in resource "google_sql_database_instance" "db":%0A   3: resource "google_sql_database_instance" "db" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":10,"Program":"tfcmt","SHA1":"7ba4c5b73958ed9405f359966d3a67b9342b51a9","Vars":{},"WorkflowName":"terraform-stg"} -->